[
  {
    "testimonial_id": 2,
    "testimonial_name": "Elisa Byfield",
    "testimonial_position": "Former Co-Founder and Media Team Member",
    "testimonial_description": "Being part of this club and being surrounded by such supportive and amazing women has truly been a gift from start to finish. As a co-founder and member of the media team, I got to help build something meaningful from the ground up, creating spaces where women in computing could feel seen, heard, and supported. Organizing and hosting events introduced me to so many amazing women who shared my passion for computing, along with the same challenges of navigating a space where there are still too few of us. <br/><br/> Before joining the media team, I didn’t have much experience in design or marketing, but it ended up helping me tap into the more creative side of tech. Collaborating with such a creative and talented team opened up a whole new side of tech for me, where creativity can take place as well. <br/><br/> It is bittersweet to be graduating just as the club is really taking off, but I am incredibly proud to have been part of something so meaningful. I have no doubt that the future of Harmony Hacks, and the women it empowers, will be bright.",
    "testimonial_image": "/HarmonyHacksWebsite/assets/testimonials/elisa.png"
  },
  {
    "testimonial_id": 1,
    "testimonial_name": "Kate Paduganao",
    "testimonial_position": "Former Co-Founder and Media Team Member",
    "testimonial_description": "Co-founding this club has been an incredibly meaningful experience. It gave me the opportunity to connect with like-minded women who share my passion for computer science and to help empower other women in STEM. Joining the media team and the board allowed me to step into a leadership role while also expressing my creativity through graphic design. I’m especially grateful to the other co-founders for trusting me to design everything from our first official logo to the overall branding of our organization.<br/><br/>One of the moments I’m most proud of was helping organize our hackathons, where we inspired young women to feel confident, prepared, and excited about pursuing careers in computer science. It was such a full-circle moment! CSUSM-hosted Hackathons that I participated in during my high school years inspired me to major in CIS; And now, I've had the chance to be on the other side, creating that inspiration for the next generation.<br/><br/>I’m incredibly excited for the future of our club and the lasting impact we’ll continue to make in empowering women in STEM.",
    "testimonial_image": "/HarmonyHacksWebsite/assets/testimonials/kate.png"
  }
  ]
  